{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Report describing a feature that updates a specific MissionSection image to use a new asset via assetPath.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries for key frontend files used in the marketing site.",
  "frontend/index.css": "Tailwind base styles defining color tokens, dark mode variants, and global background/foreground settings.",
  "frontend/index.html": "HTML entry point defining metadata, fonts, favicon, root container, and script loader.",
  "frontend/src/App.tsx": "Main React component assembling header, hero, mission, roadmap, token, footer, and toaster components.",
  "frontend/src/components/zen/Footer.tsx": "Footer with logo, quick navigation buttons, community links, and dynamic year handling.",
  "frontend/src/components/zen/HeaderNav.tsx": "Responsive navigation bar with scroll-based styling, section scrolling, and mobile menu toggle.",
  "frontend/src/components/zen/HeroSection.tsx": "Hero section with headline, CTAs, energy-source stats, and a gradient background.",
  "frontend/src/components/zen/MissionSection.tsx": "Mission section with title, description, feature cards, and an updated mascot image using assetPath.",
  "frontend/src/components/zen/RoadmapSection.tsx": "Displays a multi-phase roadmap using cards and lists generated from a phases array.",
  "frontend/src/components/zen/TokenSection.tsx": "Shows the ZEN token contract address with copy functionality, token info, and a link to Pump.fun.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity with login, logout, and identity loading behavior.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for query logic on the static marketing site.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom color palette using CSS variables for light and dark modes.",
  "frontend/src/lib/assetPath.ts": "Builds asset URLs using the deployment base path to ensure correct loading on subpaths.",
  "frontend/src/main.tsx": "Initializes React, query client, and identity provider before rendering the app.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, and extended utilities.",
  "project_state.json": "Tracks the project’s schema version, current state, feature list, known issues, and architectural notes. Represents build context and required site features for the ZEN website."
}